---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModuleIterator.Reset
source: html/855c752b-75d9-b8a1-2dd3-691950b56e93.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```